
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-ecs/actions/runs/5803840421)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.aurora.aws_cloudwatch_log_group.modify_error
* Update
  * module.aurora.module.cluster.aws_rds_cluster.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.aurora.aws_cloudwatch_log_group.modify_error will be created
  + resource "aws_cloudwatch_log_group" "modify_error" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/rds/cluster/dev-aurora-cluster/error"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev"
        }
    }

  # module.aurora.module.cluster.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
      ~ enabled_cloudwatch_logs_exports     = [
          + "general",
            # (3 unchanged elements hidden)
        ]
        id                                  = "dev-aurora-cluster"
        tags                                = {
            "Name" = "dev-aurora-cluster"
        }
        # (42 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":38,"Program":"tfcmt","SHA1":"8edaf2cfecac119bb408cd7470a47dd4c9168602","Vars":{},"WorkflowName":"dev plan"} -->